career-change-week-1.org
#+title: Career Change - Week 1
#+date: [2026-01-02 Fri 19:33]
#+HUGO_BASE_DIR: /home/james/wiki/.site
#+HUGO_SECTION: 
#+HUGO_DRAFT: false
#+HUGO_DATE: 2026-01-02
#+EXPORT_FILE_NAME: career-change-week-1

* New Beginning
:PROPERTIES:
:ID:       20260102T193300.407554
:END:
:LOGBOOK:
CLOCK: [2026-01-02 Fri 19:47]
:END:
[2026-01-02 Fri]

It is officially 2026!

Now, this week's objective is to set up a local VM running Linux, in a secure way.

[[id:20260102T195227.107104][Here]]'s the link to Week 1 part of my 12 Weeks Plan.

* KILL Tasks [5/5]

Here's a copy of the tasks from my plan, for convenience.

** DONE Install a RHEL-based distro ( Set up Rocky Linux or Fedora in a VM ) 
** KILL Master Package Management ( =dnf= or =rpm= instead of =pacman= )
** KILL Learn SELinux ( Learn how to check logs and =audit2allow= )
** KILL Learn =nmcli=
** KILL Firewall ( Learn =firewalld= )

* Continuation of last weeks task

I was working on [[id:20251228T133642.919409][installing and setting up a VM]] on my laptop which runs Arch Linux, using [[id:20251228T190207.612738][QEMU]] and [[id:20251228T134122.543389][KVM]].
