.site/content/career-change-week-1.md
+++
title = "Career Change - Week 1"
author = ["James"]
date = 2026-01-02T19:33:00+00:00
draft = false
+++

## New Beginning {#new-beginning}

<span class="timestamp-wrapper"><span class="timestamp">[2026-01-02 Fri]</span></span>

It is officially 2026!

Now, this week's objective is to set up a local VM running Linux, in a secure way.

[Here](/12-weeks-action-plan-for-my-career-change/#week-11-12-interview-drill)'s the link to Week 1 part of my 12 Weeks Plan.


## <span class="org-todo done KILL">KILL</span> Tasks <code>[5/5]</code> {#tasks}

Here's a copy of the tasks from my plan, for convenience.


### <span class="org-todo done DONE">DONE</span> Install a RHEL-based distro ( Set up Rocky Linux or Fedora in a VM ) {#install-a-rhel-based-distro--set-up-rocky-linux-or-fedora-in-a-vm}


### <span class="org-todo done KILL">KILL</span> Master Package Management ( `dnf` or `rpm` instead of `pacman` ) {#master-package-management--dnf-or-rpm-instead-of-pacman}


### <span class="org-todo done KILL">KILL</span> Learn SELinux ( Learn how to check logs and `audit2allow` ) {#learn-selinux--learn-how-to-check-logs-and-audit2allow}


### <span class="org-todo done KILL">KILL</span> Learn `nmcli` {#learn-nmcli}


### <span class="org-todo done KILL">KILL</span> Firewall ( Learn `firewalld` ) {#firewall--learn-firewalld}


## Continuation of last weeks task {#continuation-of-last-weeks-task}

I was working on [installing and setting up a VM](/setting-up-vm-for-enterprise-environment/#finalisation) on my laptop which runs Arch Linux, using [QEMU](/qemu/#hardware-emulation) and [KVM](/kvm-kernel-based-virtual-machine/#what-is-it).
